FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/СведенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СведенияКомпании</Name>
			<Comment>Некоторые сведения о компании которые могут измениться со временем (например гл. бухгалтер, руководитель...)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение сведения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоСтатусам</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоДатам</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Вид сведения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСведений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/РеализованныеАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РеализованныеАвтомобили</Name>
			<Comment>Данный блок учета предназначен для накопления информации о автомобилях, принятых на реализацию, которые были нами проданы (или иным образом списаны), но еще не включены в состав отчета комитенту</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданных автомобилей</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Стоимость автомобилей по закупке в упр. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Comment>Сумма по которой автомобиль был продан в упр. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Стоимость автомобилей по закупке в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажиРегл</Name>
					<Comment>Сумма по которой автомобиль был продан в регл. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вознаграждение</Name>
					<Comment>Сумма комиссионного вознаграждения в упр. валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Комитент чей автомобиль был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор комиссии с комитентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПередачи</Name>
					<Comment>Документ по которому к нам поступил проданный автомобиль</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыОбъектовСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСведений</Name>
			<Comment>Виды объектов сведений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>Главный бухгалтер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
					<Comment>Кассир</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоДатам</Name>
					<Comment>Стратегия списания партий товаров по датам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоСтатусам</Name>
					<Comment>Стратегия списания партий товаров по статусам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидыРазрешенныхОтрицательныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРазрешенныхОтрицательныхОстатков</Name>
			<Comment>Виды разрешенных отрицательных остатков</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запрещены</Name>
					<Comment>Отрицательные остатки запрещены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПартиям</Name>
					<Comment>Разрешены отрицательные остатки по регистру партий товаров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОстаткам</Name>
					<Comment>Разрешены отрицательные остатки по регистру остатков товаров</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ОстаткиАвтомобилей/Ext/RecordSetModule.bsl
Перем РежимПроведения Экспорт; // Режим проведения документа. Если проведение неоперативное - проверок остатков нет

Перем ДокументОбъект Экспорт; //Документ, осуществляющий движение по регистру
Перем РезультатЗапросаПоАвтомобилям Экспорт; //Выборка табличной части или таблица значений табличной части автомобилей
Перем СкладКомпании Экспорт; //Ссылка на склад компании, на котором необходимо производить приходование и резервирование. Если значение неопределено склад находится в табличной части автомобилей
Перем СкладПолучатель Экспорт; //Ссылка на склад компании, на котором необходимо производить приходование и резервирование. Если значение неопределено склад находится в табличной части автомобилей
Перем СтатусПартии Экспорт;   // Статус партии
Перем Партия Экспорт;       // Ссылка на партию
Перем СуммаПродажи Экспорт; //Имя колонки с сумой продажи (для расхода)

Перем РежимДопРасходы Экспорт; // Число. 0-нет, 1-поступление, 2-только доп расходы
Перем ГраницаРасчетаОстатков Экспорт;  // Граница расчета остатков
Перем ЗаписыватьДвижения Экспорт; // Булево. Истина - движения записываются сразу по окончании выполнения процедуры. Ложь - движения записываются при записи документа.

//В соответствии с этими флагами используются соответствующие колонки таблицы автомобилей
//Перем Приходовать Экспорт; // Булево. Истина - надо приходовать автомобили на склад
//Перем Резервировать Экспорт; // Булево. Истина - надо резервировать автомобили на складе
Перем СторноПриход Экспорт; // Флаг используется в функции Расход() и означает, что будет операция не расхода, а сторно.

// Возвращает результат запроса по таблице автомобилей
Функция ПолучитьТаблицуАвтомобилей(ВидДвижения)
	// получим результат запроса по таблице автомобилей
	ВидДок=ДокументОбъект.Метаданные().Имя;
	ЕстьГТД=ДокументОбъект.Метаданные().ТабличныеЧасти.Автомобили.Реквизиты.Найти("ГТД")<>Неопределено;
	Запрос=Новый Запрос();
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ДокументАвтомобили.Автомобиль КАК Автомобиль,
	|	"+?(СкладКомпании=Неопределено,"ДокументАвтомобили.МестоРазмещения","&СкладКомпании")+" КАК СкладКомпании,
	|	ДокументАвтомобили.СтавкаНДС КАК СтавкаНДС
	|";
	Если ТипЗнч(Партия)=Тип("Строка") Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	,ДокументАвтомобили."+Партия+" КАК Партия
		|";
	Иначе
		ТекстЗапроса=ТекстЗапроса+"
		|	,&Партия КАК Партия
		|";
	КонецЕсли; 
	Если ЕстьГТД Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	,ДокументАвтомобили.ГТД КАК ГТД";
	КонецЕсли; 
	//Если Приходовать Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА(ДокументАвтомобили.Количество) КАК Количество
		|";
	//Иначе
	//	ТекстЗапроса=ТекстЗапроса+"
	//	|	,СУММА(0) КАК Количество
	//	|";
	//КонецЕсли; 
	//Если Резервировать Тогда
	//	ТекстЗапроса=ТекстЗапроса+"
	//	|	,СУММА(ДокументАвтомобили.Резерв) КАК Резерв
	//	|";
	//Иначе
	//	ТекстЗапроса=ТекстЗапроса+"
	//	|	,СУММА(0) КАК Резерв
	//	|";
	//КонецЕсли;
	Если ВидДвижения=ВидДвиженияНакопления.Приход Тогда
		//При приходе суммы берем из документа
		ТекстЗапроса=ТекстЗапроса+",
		|Сумма(ДокументАвтомобили.СуммаВсего) КАК СуммаВсего,
		|Сумма(ДокументАвтомобили.СуммаНДС) КАК СуммаНДС";
	КонецЕсли;
	Если ТипЗнч(СуммаПродажи)=Тип("Строка") Тогда
		ТекстЗапроса=ТекстЗапроса+"
		|	,СУММА(ДокументАвтомобили."+СуммаПродажи+") КАК СуммаПродажи
		|";
	КонецЕсли; 
	ТекстЗапроса=ТекстЗапроса+"
	|ИЗ
	|	Документ."+ВидДок+".Автомобили КАК ДокументАвтомобили
	|ГДЕ
	|	ДокументАвтомобили.Ссылка=&Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументАвтомобили.Автомобиль,
	|	ДокументАвтомобили.СтавкаНДС
	|	"+?(СкладКомпании=Неопределено,",ДокументАвтомобили.МестоРазмещения",",&СкладКомпании")+"
	|	"+?(ТипЗнч(Партия)=Тип("Строка"),",ДокументАвтомобили."+Партия,",&Партия")+"
	|	"+?(ЕстьГТД,",ГТД","")+"
	|";
	Запрос.Текст=ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Партия",Партия);

	Возврат Запрос.Выполнить();
КонецФункции

// Получает наличие автомобилей на складах
//{{MRG[ <-> ]
//
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//Функция ПолучитьОстаткиАвтомобилей(ОстаткиНаСкладе, СтатусПартииОстатка = Неопределено)
//}}MRG[ <-> ]
// Параметры:
//  ОстаткиНаСкладе		 - СправочникСсылка.Склад			 - Склад
//  СтатусПартииОстатка	 - ПеречислениеСсылка.СтатусыПартий	 - Статус партии
//  УчитыватьТовары		 - Булево							 - Признак учета товаров
// 
// Возвращаемое значение:
//  Булево - Признак успшеного выполнения.
//
Функция ПолучитьОстаткиАвтомобилей(ОстаткиНаСкладе, СтатусПартииОстатка = Неопределено, УчитыватьТовары = Истина)
	Запрос = Новый Запрос();
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
	|	ОстаткиАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
	|	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
	|	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.КоличествоОстаток,0) КАК Количество,
	//|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.РезервОстаток,0) КАК Резерв,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаОстаток,0) КАК Сумма,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаУпрОстаток,0) КАК СуммаУпр,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.СуммаНДСОстаток,0) КАК СуммаНДС
	|ИЗ 
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Момент,
	|		Автомобиль В (&Автомобили)
	|	"+?(ОстаткиНаСкладе=Неопределено,"","И СкладКомпании=&СкладКомпании")+"
	|	"+?(СтатусПартииОстатка=Неопределено,"","И СтатусПартии=&СтатусПартии")+"
//{{MRG[ <-> ]
	|	"+?(УчитыватьТовары, "", "	И ТИПЗНАЧЕНИЯ(Партия) <> ТИП(Документ.ПоступлениеТоваров) 
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	|	) КАК ОстаткиАвтомобилейОстатки
//}}MRG[ <-> ]
	|								И ТИПЗНАЧЕНИЯ(Партия) <> ТИП(Документ.ПересортицаТоваров)
	|								И ТИПЗНАЧЕНИЯ(Партия) <> ТИП(Документ.ПеремещениеТоваров)
	|								И ТИПЗНАЧЕНИЯ(Партия) <> ТИП(Документ.Инвентаризация)
	|								И ТИПЗНАЧЕНИЯ(Партия) <> ТИП(Документ.ВводОстатковТоваров)")+") КАК ОстаткиАвтомобилейОстатки
	|
	|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиАвтомобилей.Остатки
	|";
	
	// Наложим блокировку на считываемые данные
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ОстаткиАвтомобилей");
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("Период", Новый Диапазон(, ДокументОбъект.Дата)); 
	Если ОстаткиНаСкладе<>Неопределено Тогда
		ЗначенияБлокировки.Вставить("СкладКомпании", ОстаткиНаСкладе); 
	КонецЕсли;
	Если СтатусПартииОстатка<>Неопределено Тогда
		Если ТипЗнч(СтатусПартииОстатка)=Тип("Массив") Тогда
			ТекстЗапроса=СтрЗаменить(ТекстЗапроса,"И СтатусПартии=&СтатусПартии","И СтатусПартии В(&СтатусПартии)");
		Иначе
			ЗначенияБлокировки.Вставить("СтатусПартии", СтатусПартииОстатка); 
		КонецЕсли;
	КонецЕсли;
	СписокАвтомобилей=РезультатЗапросаПоАвтомобилям;
	Если ТипЗнч(РезультатЗапросаПоАвтомобилям)=Тип("РезультатЗапроса") Тогда
		СписокАвтомобилей=СписокАвтомобилей.Выгрузить();
	КонецЕсли;
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных", СписокАвтомобилей);
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("Автомобиль", "Автомобиль");
	
	Запрос.Текст=ТекстЗапроса;
	Если ГраницаРасчетаОстатков=Неопределено Тогда
		ГраницаЗапроса=Новый Граница(ДокументОбъект.МоментВремени(),ВидГраницы.Исключая);
	Иначе
		ГраницаЗапроса=ГраницаРасчетаОстатков;
	КонецЕсли; 
	Запрос.УстановитьПараметр("Момент",ГраницаЗапроса);
	Запрос.УстановитьПараметр("Автомобили",СписокАвтомобилей.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("СкладКомпании",ОстаткиНаСкладе);
	Запрос.УстановитьПараметр("СтатусПартии",СтатусПартииОстатка);
	
	обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Формирует движения по регистру приход (увеличение товарного запаса)
//// Возвращаемое значение: Булево. Истина - все хорошо, Ложь - чего-то не так.
Функция Приход() Экспорт
	ВсеОК=Истина;
	
	// получим таблицу состава автомобилей
	Если (РезультатЗапросаПоАвтомобилям=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоАвтомобилям=ПолучитьТаблицуАвтомобилей(ВидДвиженияНакопления.Приход);
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоАвтомобилям)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоАвтомобилям=РезультатЗапросаПоАвтомобилям.Выгрузить();
	КонецЕсли;
	
	//Получение остатков автомобилей по компании целиком
	ТаблицаОстатковАвтомобилей=ПолучитьОстаткиАвтомобилей(Неопределено,Неопределено);
	ТаблицаОстатковАвтомобилей.Сортировать("СкладКомпании, Автомобиль, Партия УБЫВ");
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
	СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ДокументОбъект.Дата);
	КурсРегл	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
	Попытка
		КурсУпр=ДокументОбъект.КурсВалютыУпр;
	Исключение
		КурсУпр=Неопределено;
	КонецПопытки; 
	Если КурсУпр=Неопределено ИЛИ обЗначениеНеЗаполнено(КурсУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ДокументОбъект.Дата);
		КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;
	
	//При приходовании авто из филиала попробуем получить партии 
	Если ДокументОбъект.ХозОперация=Справочники.ХозОперации.ПеремещениеАвтомобилейИзФилиала И
		 ТипЗнч(ДокументОбъект.ДокументОснование)=Тип("ДокументСсылка.ПеремещениеАвтомобилей") И
		 ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) И
		 ДокументОбъект.ДокументОснование.ХозОперация=Справочники.ХозОперации.ПеремещениеАвтомобилейВФилиал Тогда
		 Запрос=Новый Запрос;
		 Запрос.Текст="ВЫБРАТЬ
		              |	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
		              |	ОстаткиАвтомобилей.СкладКомпании КАК СкладКомпании,
		              |	ОстаткиАвтомобилей.СтатусПартии КАК СтатусПартии,
		              |	ОстаткиАвтомобилей.Партия КАК Партия,
		              |	ОстаткиАвтомобилей.ГТД КАК ГТД,
		              |	СУММА(ОстаткиАвтомобилей.Количество) КАК Количество,
		              |	СУММА(ОстаткиАвтомобилей.Сумма) КАК Сумма,
		              |	СУММА(ОстаткиАвтомобилей.СуммаУпр) КАК СуммаУпр,
		              |	СУММА(ОстаткиАвтомобилей.СуммаНДС) КАК СуммаНДС
		              |ИЗ
		              |	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		              |ГДЕ
		              |	ОстаткиАвтомобилей.Регистратор = &Регистратор
		              |	И ОстаткиАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		              |	И ОстаткиАвтомобилей.Автомобиль В (&Автомобиль)
		              |
		              |СГРУППИРОВАТЬ ПО
		              |	ОстаткиАвтомобилей.Партия,
		              |	ОстаткиАвтомобилей.СтатусПартии,
		              |	ОстаткиАвтомобилей.Автомобиль,
		              |	ОстаткиАвтомобилей.СкладКомпании,
		              |	ОстаткиАвтомобилей.ГТД";
		 Запрос.УстановитьПараметр("Регистратор",ДокументОбъект.ДокументОснование);
		 Запрос.УстановитьПараметр("Автомобиль",РезультатЗапросаПоАвтомобилям.ВыгрузитьКолонку("Автомобиль"));
		 ВыборкаПартийАвтомобилей=Запрос.Выполнить().Выгрузить();
	Иначе
		 ВыборкаПартийАвтомобилей=Неопределено;
	КонецЕсли;
		 
	//Перебираем строки автомобилей
	Для каждого СтрокаАвтомобиля Из РезультатЗапросаПоАвтомобилям Цикл
		//Получим склад
		Склад=?(СкладКомпании=Неопределено,СтрокаАвтомобиля.СкладКомпании,СкладКомпании);
		//Если Приходовать Тогда
			Количество=СтрокаАвтомобиля.Количество;
		//Иначе 
		//	Количество=0;
		//КонецЕсли;
		//Если Резервировать Тогда Резерв=СтрокаАвтомобиля.Резерв; Иначе Резерв=0; КонецЕсли;
		Если РежимДопРасходы<>2 Тогда
			//Получим остатки по текущему автомобилю
			КоличествоВНаличии=0;
			КоличествоНаСкладе=0;
			//РезервНаСкладе=0;
			МассивОстатковАвтомобиля=ТаблицаОстатковАвтомобилей.НайтиСтроки(Новый Структура("Автомобиль",СтрокаАвтомобиля.Автомобиль));
			Для каждого ОстатокАвтомобиля Из МассивОстатковАвтомобиля Цикл
				КоличествоВНаличии=КоличествоВНаличии+ОстатокАвтомобиля.Количество;
				Если ОстатокАвтомобиля.СкладКомпании=Склад Тогда
					КоличествоНаСкладе=КоличествоНаСкладе+ОстатокАвтомобиля.Количество;
					//РезервНаСкладе=РезервНаСкладе+ОстатокАвтомобиля.Резерв;
				КонецЕсли; 
				ТаблицаОстатковАвтомобилей.Удалить(ОстатокАвтомобиля);
			КонецЦикла; 
			//Запрещено иметь более одного автомобиля
			//Если Приходовать Тогда
				Если (КоличествоВНаличии+Количество)>1 Тогда
					//Если на складе 
					дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобиля.Автомобиль)+""" уже имеется. Повторный приход автомобиля недопустим.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобиля.Автомобиль);
					ВсеОК=Ложь;
				КонецЕсли; 
			//КонецЕсли; 
			////Проверим что есть автомобили для резервирования
			//Если Резервировать Тогда
			//	Если (Резерв<0) И ((-Резерв)>(РезервНаСкладе)) Тогда
			//		//Если осуществляется снятие резерва, снятие резерва не должно превышать остаток резерва
			//		дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобиля.Автомобиль)+""" не зарезервирован. Снятие резерва невозможно.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобиля.Автомобиль);
			//		ВсеОК=Ложь;
			//	КонецЕсли; 
			//	Если (Резерв>0) И (Резерв>(КоличествоНаСкладе+Количество)) Тогда
			//		//Если осуществляется резервирование больше остатка на складе
			//		дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобиля.Автомобиль)+""" отсутствует. Резервирование невозможно.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобиля.Автомобиль);
			//		ВсеОК=Ложь;
			//	КонецЕсли; 
			//КонецЕсли;
		КонецЕсли; 
		Если ВсеОК Тогда
			НоваяЗапись = Добавить();
			НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период        = ДокументОбъект.Дата;
			НоваяЗапись.Регистратор   = ДокументОбъект.Ссылка;
			НоваяЗапись.Автомобиль    = СтрокаАвтомобиля.Автомобиль;
			НоваяЗапись.СкладКомпании = Склад;
			Если ВыборкаПартийАвтомобилей<>Неопределено Тогда
				СтрокаПартийАвтомобилей=ВыборкаПартийАвтомобилей.Найти(СтрокаАвтомобиля.Автомобиль,"Автомобиль");
			Иначе
				СтрокаПартийАвтомобилей=Неопределено;
			КонецЕсли;
			Если СтрокаПартийАвтомобилей=Неопределено Тогда
				Если СтатусПартии=Неопределено Тогда
					НоваяЗапись.СтатусПартии  = Перечисления.СтатусыПартий.ТоварКупленный;
				Иначе
					НоваяЗапись.СтатусПартии  = СтатусПартии;
				КонецЕсли;
				НоваяЗапись.Партия        = ?(ТипЗнч(Партия)=Тип("Строка"),СтрокаАвтомобиля.Партия,Партия);
			Иначе
				НоваяЗапись.СтатусПартии  = СтрокаПартийАвтомобилей.СтатусПартии;
				НоваяЗапись.Партия        = СтрокаПартийАвтомобилей.Партия;
			КонецЕсли;
			НоваяЗапись.ГТД           = СтрокаАвтомобиля.ГТД;
			НоваяЗапись.Количество    = ?(РежимДопРасходы=2,0,Количество);
			//НоваяЗапись.Резерв=Резерв;
			ДопРасходы=?(РежимДопРасходы=0,0,СтрокаАвтомобиля.ДопРасходы);
			НДСДопРасходов=?(РежимДопРасходы=0,0,СтрокаАвтомобиля.НДСДопРасходов);
			НоваяЗапись.Сумма=Окр(?(СтрокаАвтомобиля.СуммаВсего=NULL,0,обПересчет(?(РежимДопРасходы=2,0,СтрокаАвтомобиля.СуммаВсего)+ДопРасходы,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаРегл,КурсРегл)),2);
			НоваяЗапись.СуммаУпр=Окр(?(СтрокаАвтомобиля.СуммаВсего=NULL,0,обПересчет(?(РежимДопРасходы=2,0,СтрокаАвтомобиля.СуммаВсего)+ДопРасходы,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаУпр,КурсУпр)),2);
			НоваяЗапись.СуммаНДС=Окр(?(СтрокаАвтомобиля.СуммаНДС=NULL,0,обПересчет(?(РежимДопРасходы=2,0,СтрокаАвтомобиля.СуммаНДС)+НДСДопРасходов,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаРегл,КурсРегл)),2);
			НоваяЗапись.ХозОперация=ДокументОбъект.ХозОперация;
			Попытка
				НоваяЗапись.СтавкаНДС=СтрокаАвтомобиля.СтавкаНДС;
			Исключение
			КонецПопытки; 
			
		КонецЕсли; 
	КонецЦикла; 
	
	// запись движений
	ЗаписыватьДвижения=?(ЗаписыватьДвижения=Неопределено,Истина,ЗаписыватьДвижения);
	Если ВсеОК И ЗаписыватьДвижения Тогда Записать(); КонецЕсли; 
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	РезультатЗапросаПоАвтомобилям=Неопределено;
	СкладКомпании=Неопределено;
	СкладПолучатель=Неопределено;
	Партия=Неопределено;
	
	Возврат ВсеОК;
КонецФункции

// Формирует движения по регистру расход (уменьшение товарного запаса)
// Возвращаемое значение: Булево. Истина - все хорошо, Ложь - чего-то не так.
Функция Расход() Экспорт
	
	ВсеОК = Истина;
	
	// получим таблицу состава автомобилей
	Если (РезультатЗапросаПоАвтомобилям=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("РезультатЗапроса")) И (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоАвтомобилям=ПолучитьТаблицуАвтомобилей(ВидДвиженияНакопления.Расход);
	КонецЕсли;
	Если ТипЗнч(РезультатЗапросаПоАвтомобилям)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоАвтомобилям=РезультатЗапросаПоАвтомобилям.Выгрузить();
	КонецЕсли;
	//Получение остатков автомобилей по компании целиком
//{{MRG[ <-> ]
	ТаблицаОстатковАвтомобилей = ПолучитьОстаткиАвтомобилей(СкладКомпании, СтатусПартии, Ложь);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	ТаблицаОстатковАвтомобилей = ПолучитьОстаткиАвтомобилей(СкладКомпании, СтатусПартии);
//}}MRG[ <-> ]
	ТаблицаОстатковАвтомобилей.Свернуть("СкладКомпании,Автомобиль,Партия,СтатусПартии,ГТД","Количество,Сумма,СуммаНДС,СуммаУпр");
	ТаблицаОстатковАвтомобилей.Сортировать("СкладКомпании, Автомобиль, Партия УБЫВ");
	
	СторноПриход = ?(СторноПриход=Неопределено, Ложь, СторноПриход);
	//Перебираем строки автомобилей
	Для Каждого СтрокаАвтомобилей Из РезультатЗапросаПоАвтомобилям Цикл
		//Получим склад
		Склад = ?(СкладКомпании=Неопределено, СтрокаАвтомобилей.СкладКомпании, СкладКомпании);
		Если ТипЗнч(Склад)<>Тип("СправочникСсылка.СкладыКомпании") Тогда
			Продолжить;
		КонецЕсли; 
		//Если Приходовать Тогда Количество = СтрокаАвтомобилей.Количество; Иначе Количество=0; КонецЕсли;
		//Если Резервировать Тогда
		//	Резерв=СтрокаАвтомобилей.Резерв;
		//Иначе
		//	Резерв=0;
		//КонецЕсли;  
		
		//<<ЧалапАю БизТех 01.08.2024
		ЗапросТекСклад = Новый Запрос("ВЫБРАТЬ
		                              |	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
		                              |	ОстаткиАвтомобилейОстатки.СкладКомпании КАК Склад
		                              |ИЗ
		                              |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаОстатка, ) КАК ОстаткиАвтомобилейОстатки
		                              |ГДЕ
		                              |	ОстаткиАвтомобилейОстатки.Автомобиль = &Автомобиль");
		ЗапросТекСклад.УстановитьПараметр("Автомобиль",СтрокаАвтомобилей.Автомобиль);
		ЗапросТекСклад.УстановитьПараметр("ДатаОстатка",ДокументОбъект.МоментВремени());
		РезультатТекСклад =ЗапросТекСклад.Выполнить().Выгрузить(); 
		//ЧалапАю БизТех 01.08.2024  >>

		
		Количество = СтрокаАвтомобилей.Количество;
		МассивОстатковАвтомобиля = ТаблицаОстатковАвтомобилей.НайтиСтроки(Новый Структура("Автомобиль,СкладКомпании",СтрокаАвтомобилей.Автомобиль,Склад));
		Если МассивОстатковАвтомобиля.Количество()=0 Тогда
			дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобилей.Автомобиль)+""" отсутствует на складе """+СокрЛП(СкладКомпании)+""". Расход невозможен.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобилей.Автомобиль);
			//<<ЧалапАю БихТех 01.08.2024	
			Если РезультатТекСклад.Количество()>0 тогда
				Сообщить("Автомобиль """+СокрЛП(СтрокаАвтомобилей.Автомобиль)+""" находится на складе """ + РезультатТекСклад[0].Склад+"""."); //ЧалапАю БихТех 01.08.2024
			иначе
				Сообщить("Автомобиль """+СокрЛП(СтрокаАвтомобилей.Автомобиль)+""" отсуствует на остатках."); 
			КонецЕсли; 
			//ЧалапАю БихТех 01.08.2024>>
			ВсеОК=Ложь;
			Продолжить;
		КонецЕсли; 
		ПеремещаемыйАвтомобиль = МассивОстатковАвтомобиля[0];
		//Если Приходовать Тогда
			//Если осуществляется расход по складу
			//Если Количество>(ПеремещаемыйАвтомобиль.Количество-ПеремещаемыйАвтомобиль.Резерв+Резерв) Тогда
			//	//Расход по складу превышает остаток
			//	дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобилей.Автомобиль)+""" отсутствует или зарезервирован. Расход невозможен.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобилей.Автомобиль);
			//	ВсеОК=Ложь;
			//КонецЕсли; 
			Если Количество>ПеремещаемыйАвтомобиль.Количество Тогда
				//Расход по складу превышает остаток
				дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобилей.Автомобиль)+""" отсутствует. Расход невозможен.","Важное&Остатки автомобилей:",ДокументОбъект, СтрокаАвтомобилей.Автомобиль);
				ВсеОК=Ложь;
			КонецЕсли; 
		//КонецЕсли; 
		//Если Резервировать Тогда
		//	Если Резерв>ПеремещаемыйАвтомобиль.Резерв Тогда
		//		дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобилей.Автомобиль)+""" не зарезервирован. Снятие резерва невозможно.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобилей.Автомобиль);
		//		ВсеОК=Ложь;
		//	КонецЕсли; 
		//КонецЕсли;
		Если ДокументОбъект.ХозОперация = Справочники.ХозОперации.РеализацияАвтомобилейКомиссия Тогда
			//Для передачи автомобиля на комиссию проверим чтобы данный автомобиль не был комиссионным
			Если ПеремещаемыйАвтомобиль.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
				дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобилей.Автомобиль)+""" принят на комиссию. Передача комиссионных автомобилей на комиссию невозможна.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобилей.Автомобиль);
				ВсеОК=Ложь;
			КонецЕсли; 
		КонецЕсли; 
		Если ДокументОбъект.ХозОперация=Справочники.ХозОперации.РеализацияАвтомобилей ИЛИ
			 ДокументОбъект.ХозОперация=Справочники.ХозОперации.РеализацияАвтомобилейКомиссия Тогда
			//Для реализации автомобилей он не должен быть на ответственном хранении
			Если ПеремещаемыйАвтомобиль.СтатусПартии=Перечисления.СтатусыПартий.ТоварОтветственноеХранение Тогда
				дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобилей.Автомобиль)+""" находится на ответственном хранении. Реализация автомобилей на ответственном хранении невозможна.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобилей.Автомобиль);
				ВсеОК = Ложь;
			КонецЕсли;
		КонецЕсли; 
		//Если ВсеОК И (Количество<>0 ИЛИ Резерв<>0) Тогда
		Если ВсеОК И (Количество<>0) Тогда
			НоваяЗапись = Добавить();
			НоваяЗапись.ВидДвижения   = ?(СторноПриход, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
			НоваяЗапись.Период        = ДокументОбъект.Дата;
			НоваяЗапись.Регистратор   = ДокументОбъект.Ссылка;
			НоваяЗапись.Автомобиль    = СтрокаАвтомобилей.Автомобиль;
			НоваяЗапись.СкладКомпании = Склад;
			НоваяЗапись.СтатусПартии  = ПеремещаемыйАвтомобиль.СтатусПартии;
			НоваяЗапись.Партия        = ПеремещаемыйАвтомобиль.Партия;
			НоваяЗапись.ГТД           = ПеремещаемыйАвтомобиль.ГТД;
			НоваяЗапись.Количество    = Количество;
			//НоваяЗапись.Резерв=Резерв;
			НоваяЗапись.ХозОперация   = ДокументОбъект.ХозОперация;
			//Если НЕ Приходовать И Резервировать Тогда
			//	//суммовые не трогаем
			//Иначе
			НоваяЗапись.Сумма         = ПеремещаемыйАвтомобиль.Сумма;
			НоваяЗапись.СуммаУпр      = ПеремещаемыйАвтомобиль.СуммаУпр;
			НоваяЗапись.СуммаНДС      = ПеремещаемыйАвтомобиль.СуммаНДС;
			//КонецЕсли;
			Если СторноПриход Тогда
				НоваяЗапись.Количество	= -НоваяЗапись.Количество;
				//НоваяЗапись.Резерв		= -НоваяЗапись.Резерв;
				НоваяЗапись.Сумма		= -НоваяЗапись.Сумма;
				НоваяЗапись.СуммаУпр	= -НоваяЗапись.СуммаУпр;
				НоваяЗапись.СуммаНДС	= -НоваяЗапись.СуммаНДС;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	// запись движений
	ЗаписыватьДвижения = ?(ЗаписыватьДвижения = Неопределено, Истина, ЗаписыватьДвижения);
	Если ВсеОК И ЗаписыватьДвижения Тогда 
		Записать(); 
	КонецЕсли; 
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	РезультатЗапросаПоАвтомобилям=Неопределено;
	СкладКомпании=Неопределено;
	СкладПолучатель=Неопределено;
	Партия=Неопределено;
	СторноПриход=Неопределено;
	
	// возврат результата
	Возврат ВсеОК;
КонецФункции

// Формирует перемещение автомобилей с одного склада на другой
// Возвращаемое значение: Булево. Истина - все хокей, Ложь - чего-то не так.
Функция Переместить() Экспорт
	ВсеОК=Истина;
	
	// получим таблицу состава автомобилей
	Если (РезультатЗапросаПоАвтомобилям=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("РезультатЗапроса")) Тогда
		РезультатЗапросаПоАвтомобилям=ПолучитьТаблицуАвтомобилей(ВидДвиженияНакопления.Расход);
	КонецЕсли;
	//Получение остатков автомобилей по компании целиком
	ТаблицаОстатковАвтомобилей=ПолучитьОстаткиАвтомобилей(СкладКомпании,Неопределено);
	ТаблицаОстатковАвтомобилей.Сортировать("СкладКомпании, Автомобиль, Партия УБЫВ");
	
	//Перебираем строки автомобилей
	Выборка=РезультатЗапросаПоАвтомобилям.Выбрать();
	Пока Выборка.Следующий() Цикл
		//Получим склад
		Количество=Выборка.Количество;
		//Получим остатки по текущему автомобилю
		КоличествоНаСкладе=0;
		//РезервНаСкладе=0;
		СуммаНаСкладе=0;
		СуммаУпрНаСкладе=0;
		СуммаНДСНаСкладе=0;  
		
		//ЧалапАю БизТех 01.08.2024
		ЗапросТекСклад = Новый Запрос("ВЫБРАТЬ
		                              |	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
		                              |	ОстаткиАвтомобилейОстатки.СкладКомпании КАК Склад
		                              |ИЗ
		                              |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаОстатка, ) КАК ОстаткиАвтомобилейОстатки
		                              |ГДЕ
		                              |	ОстаткиАвтомобилейОстатки.Автомобиль = &Автомобиль");
		ЗапросТекСклад.УстановитьПараметр("Автомобиль",Выборка.Автомобиль);
		ЗапросТекСклад.УстановитьПараметр("ДатаОстатка",ДокументОбъект.МоментВремени());
		РезультатТекСклад =ЗапросТекСклад.Выполнить().Выгрузить(); 
		//ЧалапАю БизТех 01.08.2024

		
		МассивОстатковАвтомобиля = ТаблицаОстатковАвтомобилей.НайтиСтроки(Новый Структура("Автомобиль,СкладКомпании",Выборка.Автомобиль,СкладКомпании));
		Если МассивОстатковАвтомобиля.Количество()=0 Тогда
			дкСообщитьРезультат("Автомобиль """+СокрЛП(Выборка.Автомобиль)+""" отсутствует на складе """+СокрЛП(СкладКомпании)+""". Перемещение невозможно.","Важное&Остатки автомобилей:",ДокументОбъект,Выборка.Автомобиль);
			//<<ЧалапАю БихТех 01.08.2024	
			Если РезультатТекСклад.Количество()>0 тогда
				Сообщить("Автомобиль """+СокрЛП(Выборка.Автомобиль)+""" находится на складе """ + РезультатТекСклад[0].Склад+"""."); //ЧалапАю БихТех 01.08.2024
			иначе
				Сообщить("Автомобиль """+СокрЛП(Выборка.Автомобиль)+""" отсуствует на остатках."); 
			КонецЕсли; 
			//ЧалапАю БихТех 01.08.2024>>
ВсеОК=Ложь;
		КонецЕсли; 
		Если ВсеОК Тогда
			ПеремещаемыйАвтомобиль=МассивОстатковАвтомобиля[0];
			//Проведем расход
			НоваяЗапись = Добавить();
			НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Период        = ДокументОбъект.Дата;
			НоваяЗапись.Регистратор   = ДокументОбъект.Ссылка;
			НоваяЗапись.Автомобиль    = Выборка.Автомобиль;
			НоваяЗапись.СкладКомпании = СкладКомпании;
			НоваяЗапись.СтатусПартии  = ПеремещаемыйАвтомобиль.СтатусПартии;
			НоваяЗапись.Партия        = ПеремещаемыйАвтомобиль.Партия;
			НоваяЗапись.ГТД           = ПеремещаемыйАвтомобиль.ГТД;
			НоваяЗапись.Количество    = Количество;
			//НоваяЗапись.Резерв        = ПеремещаемыйАвтомобиль.Резерв;
			НоваяЗапись.Сумма         = ПеремещаемыйАвтомобиль.Сумма;
			НоваяЗапись.СуммаУпр      = ПеремещаемыйАвтомобиль.СуммаУпр;
			НоваяЗапись.СуммаНДС      = ПеремещаемыйАвтомобиль.СуммаНДС;
			НоваяЗапись.ХозОперация   = ДокументОбъект.ХозОперация;
			//Проведем приход
			НоваяЗапись=Добавить();
			НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период        = ДокументОбъект.Дата;
			НоваяЗапись.Регистратор   = ДокументОбъект.Ссылка;
			НоваяЗапись.Автомобиль    = Выборка.Автомобиль;
			НоваяЗапись.СкладКомпании = СкладПолучатель;
			НоваяЗапись.СтатусПартии  = ПеремещаемыйАвтомобиль.СтатусПартии;
			НоваяЗапись.Партия        = ПеремещаемыйАвтомобиль.Партия;
			НоваяЗапись.ГТД           = ПеремещаемыйАвтомобиль.ГТД;
			НоваяЗапись.Количество    = Количество;
			//НоваяЗапись.Резерв        = ПеремещаемыйАвтомобиль.Резерв;
			НоваяЗапись.Сумма         = ПеремещаемыйАвтомобиль.Сумма;
			НоваяЗапись.СуммаУпр      = ПеремещаемыйАвтомобиль.СуммаУпр;
			НоваяЗапись.СуммаНДС      = ПеремещаемыйАвтомобиль.СуммаНДС;
			НоваяЗапись.ХозОперация   = ДокументОбъект.ХозОперация;
		КонецЕсли; 
	КонецЦикла; 
	
	// запись движений
	ЗаписыватьДвижения=?(ЗаписыватьДвижения=Неопределено,Истина,ЗаписыватьДвижения);
	Если ВсеОК И ЗаписыватьДвижения Тогда 
		Записать(); 
	КонецЕсли; 
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	РезультатЗапросаПоАвтомобилям=Неопределено;
	СкладКомпании=Неопределено;
	СкладПолучатель=Неопределено;
	Партия=Неопределено;
	
	// возврат результата
	Возврат ВсеОК;
КонецФункции

// Переоценка автомобилей
Функция Переоценка() Экспорт
	СтруктураОтбора=Новый Структура("Организация,Объект",ДокументОбъект.Организация,Перечисления.ВидыОбъектовСведений.СтратегияСписанияПоДатам);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДокументОбъект.Дата,СтруктураОтбора);
	// валюты
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ДокументОбъект.Дата);
	КурсРегл	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Попытка
		КурсУпр=ДокументОбъект.КурсВалютыУпр;
	Исключение
		КурсУпр=Неопределено;
	КонецПопытки; 
	Если КурсУпр=Неопределено ИЛИ обЗначениеНеЗаполнено(КурсУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ДокументОбъект.Дата);
		КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;

	Если (РезультатЗапросаПоАвтомобилям=Неопределено) ИЛИ ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("РезультатЗапроса") Тогда
		// если неопределен результат запроса по таблице автомобилей, значит она в документе.
		ВидДок=ДокументОбъект.Метаданные().Имя;
		Запрос=Новый Запрос("
		|ВЫБРАТЬ
		|	ПереоценкаАвтомобили.Автомобиль КАК Автомобиль,
		|	"+?(СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия,"ПереоценкаАвтомобили.ДокументПередачи КАК Партия,","")+"
		|	ПереоценкаАвтомобили.Количество КАК Количество,
		|	ПереоценкаАвтомобили.Цена КАК ЦенаНовая
		|ИЗ
		|	Документ."+ВидДок+".Автомобили КАК ПереоценкаАвтомобили
		|ГДЕ
		|	ПереоценкаАвтомобили.Ссылка=&Ссылка
		|");
		Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
		РезультатЗапросаПоАвтомобилям=Запрос.Выполнить();
	КонецЕсли;
	// получаем запрос по партиям
	Если СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
		// у нас переоценка принятых, выгрузим партии
		//Подлежит исправлению YABS. 
		//Так откуда партию брать то ?
		//Если ДокументОбъект.ДокументОснование.Пустая() Тогда
			МассивПартий=РезультатЗапросаПоАвтомобилям.Выгрузить().ВыгрузитьКолонку("Партия");
		//Иначе
		//	МассивПартий=Новый Массив(1); МассивПартий[0]=ДокументОбъект.ДокументОснование;
		//КонецЕсли;
	КонецЕсли;
	ТаблицаПартий=ПолучитьОстаткиАвтомобилей(СкладКомпании,СтатусПартии);
	// создаем структуру отбора
	СтруктураОтбора=Новый Структура("Автомобиль"+?(СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия,",Партия",""));
	// переоцениваем
	ТаблицаАвтомобили=РезультатЗапросаПоАвтомобилям.Выгрузить();
	Для Каждого СтрокаАвтомобиль Из ТаблицаАвтомобили Цикл
		// определяем фильтр
		СтруктураОтбора.Автомобиль=СтрокаАвтомобиль.Автомобиль;
		Если СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
			СтруктураОтбора.Партия=СтрокаАвтомобиль.Партия;
		КонецЕсли;
		НадоПереоценить=СтрокаАвтомобиль.Количество;
		МассивНайденныхСтрок=ТаблицаПартий.НайтиСтроки(СтруктураОтбора);
		Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
			ТекСтрока=МассивНайденныхСтрок[Сч];
			// расчет суммы переоценки
			НадоПереоценить=?(НадоПереоценить=0,ТекСтрока.Количество,НадоПереоценить);
			СуммаПереоценки=обПересчет(СтрокаАвтомобиль.ЦенаНовая,ДокументОбъект.ВалютаДокумента,ДокументОбъект.КурсДокумента,ВалютаРегл,КурсРегл)*Мин(НадоПереоценить,ТекСтрока.Количество);
			СуммаПереоценки=СуммаПереоценки-?(ТекСтрока.Количество=0,0,(ТекСтрока.Сумма/ТекСтрока.Количество)*Мин(НадоПереоценить,ТекСтрока.Количество));
			// если нечего переоценивать, то выходим
			Если СуммаПереоценки=0 Тогда Продолжить; Конецесли;
			НоваяЗапись=Добавить();
			НоваяЗапись.ВидДвижения=?(СуммаПереоценки>0,ВидДвиженияНакопления.Приход,ВидДвиженияНакопления.Расход);
			НоваяЗапись.Период=ДокументОбъект.Дата;
			НоваяЗапись.Регистратор=ДокументОбъект.Ссылка;
			Партия=ТекСтрока.Партия;
			НоваяЗапись.Партия = Партия;
			НоваяЗапись.СтатусПартии=ТекСтрока.СтатусПартии;
			НоваяЗапись.СкладКомпании=ТекСтрока.СкладКомпании;
			НоваяЗапись.Автомобиль=ТекСтрока.Автомобиль;
			НоваяЗапись.ГТД=ТекСтрока.ГТД;
			НоваяЗапись.ХозОперация=ДокументОбъект.ХозОперация;
			НоваяЗапись.Количество=0;
			// суммы
			НоваяЗапись.Сумма=Окр(?(СуммаПереоценки>0,СуммаПереоценки,-СуммаПереоценки),2);
			НоваяЗапись.СуммаУпр=Окр(обПересчет(НоваяЗапись.Сумма,ВалютаРегл,КурсРегл,ВалютаУпр,КурсУпр),2);
			НоваяЗапись.СуммаНДС=НоваяЗапись.Сумма/ТекСтрока.Сумма*ТекСтрока.СуммаНДС;
			НадоПереоценить=НадоПереоценить-Мин(НадоПереоценить,ТекСтрока.Количество);
			// удалим ненужные строки
			ТаблицаПартий.Удалить(ТекСтрока);
			Если НадоПереоценить=0 Тогда Прервать; КонецЕсли;
		КонецЦикла
	КонецЦикла;

	// запись движений
	ЗаписыватьДвижения=?(ЗаписыватьДвижения=Неопределено,Истина,ЗаписыватьДвижения);
	Если ЗаписыватьДвижения Тогда Записать(); КонецЕсли;
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	РезультатЗапросаПоАвтомобилям=Неопределено;
	СкладКомпании=Неопределено;
	СкладПолучатель=Неопределено;
	Партия=Неопределено;
	
	Возврат Истина;
КонецФункции

// Формирует движения по сторнированию прихода/расхода
// ВидДвижения - ВидДвиженияРегистраНакопления. Если Приход, тогда у нас возврат от поставщика иначе - от покупателя
// Возвращает Истина - все хорошо, Ложь - чего-то не так.
Функция ВозвратАвтомобилей(ВидДвижения) Экспорт
	ВсеОК=Истина;
	
	ПартииУказаны=НЕ обЗначениеНеЗаполнено(Партия);
	
	// Получим таблицу состава автомобилей
	Если (РезультатЗапросаПоАвтомобилям=Неопределено) ИЛИ (ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("РезультатЗапроса") И ТипЗнч(РезультатЗапросаПоАвтомобилям)<>Тип("ТаблицаЗначений")) Тогда
		РезультатЗапросаПоАвтомобилям=ПолучитьТаблицуАвтомобилей(ВидДвиженияНакопления.Расход);
	КонецЕсли;
	// Если передали результат запроса, то выгрузим в таблицу значений
	Если ТипЗнч(РезультатЗапросаПоАвтомобилям)=Тип("РезультатЗапроса") Тогда
		РезультатЗапросаПоАвтомобилям=РезультатЗапросаПоАвтомобилям.Выгрузить();
	КонецЕсли;
	
	СтруктураОтбора=Новый Структура("Организация,Объект",ДокументОбъект.Организация,Перечисления.ВидыОбъектовСведений.СтратегияСписанияПоДатам);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ДокументОбъект.Дата,СтруктураОтбора);

	Если ВидДвижения=ВидДвиженияНакопления.Приход Тогда
		// ВОЗВРАТ ПОСТАВЩИКУ
		// Получим режим возврата.
		РежимВозврата=обПраво("РежимСписанияПриВозвратеПоставщику",ДокументОбъект.Права,,ДокументОбъект); 
		ОтрицательныеОстаткиРазрешены = (обПраво("РазрешитьОтрицательныеСкладскиеОстатки",ДокументОбъект.Права,,ДокументОбъект)<>Перечисления.ВидыРазрешенныхОтрицательныхОстатков.Запрещены);
		Если ОтрицательныеОстаткиРазрешены Тогда
			ВыводитьКритическиеСообщения = обПраво("ВыводитьСообщенияПроверкиПравДоступа",ДокументОбъект.Права,,ДокументОбъект);
		Иначе
			ВыводитьКритическиеСообщения = Ложь;
		КонецЕсли;
		
		// Получим таблицу партий.
		ТекстЗапроса="ВЫБРАТЬ
		             |	ВЫБОР
		             |		КОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ПоступлениеАвтомобилей) В (&Партии)
					 |		  ИЛИ ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ВводОстатковАвтомобилей) В (&Партии)
		             |			ТОГДА 0
		             |		КОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ПоступлениеАвтомобилей).Контрагент = &Контрагент
					 |		  ИЛИ ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ВводОстатковАвтомобилей).Контрагент = &Контрагент
		             |			ТОГДА 1
		             |		ИНАЧЕ 2
		             |	КОНЕЦ КАК ПорядокСписанияПартий,
		             |	ОстаткиАвтомобилейОстатки.Автомобиль,
		             |	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
		             |	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД,
		             |	ОстаткиАвтомобилей.СтавкаНДС,
		             |	СРЕДНЕЕ(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Количество,
		             //|	СРЕДНЕЕ(ОстаткиАвтомобилейОстатки.РезервОстаток) КАК Резерв,
		             |	СРЕДНЕЕ(ОстаткиАвтомобилейОстатки.СуммаОстаток) КАК Сумма,
		             |	СРЕДНЕЕ(ОстаткиАвтомобилейОстатки.СуммаУпрОстаток) КАК СуммаУпр,
		             |	СРЕДНЕЕ(ОстаткиАвтомобилейОстатки.СуммаНДСОстаток) КАК СуммаНДС
		             |ИЗ
		             |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
		             |		&Момент,
		             |		СкладКомпании = &СкладКомпании
		             |		    И Автомобиль В (&Автомобиль)
					 |		    И СтатусПартии = &СтатусПартии
					 |	) КАК ОстаткиАвтомобилейОстатки
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		             |		ПО ОстаткиАвтомобилейОстатки.Партия = ОстаткиАвтомобилей.Партия
		             |			И ОстаткиАвтомобилейОстатки.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		             |			И ОстаткиАвтомобилейОстатки.Партия = ОстаткиАвтомобилей.Регистратор
		             |			И ОстаткиАвтомобилейОстатки.СкладКомпании = ОстаткиАвтомобилей.СкладКомпании
					 |			И ОстаткиАвтомобилейОстатки.СтатусПартии = ОстаткиАвтомобилей.СтатусПартии
		             |			И (ОстаткиАвтомобилей.ВидДвижения = &ВидДвиженияПриход)";
		Если РежимВозврата<>Перечисления.РежимыСписанияПриВозврате.ПоОстаткамТоваров Тогда
			Если РежимВозврата=Перечисления.РежимыСписанияПриВозврате.ТолькоПоУказаннойПартии Тогда
				ТекстЗапроса=ТекстЗапроса+"
				|ГДЕ
				|	ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ПоступлениеАвтомобилей) В (&Партии)
				|	ИЛИ ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ВводОстатковАвтомобилей) В (&Партии)";
			Иначе
				ТекстЗапроса=ТекстЗапроса+"
				|ГДЕ
				|	ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ПоступлениеАвтомобилей).Контрагент=&Контрагент
				|	ИЛИ ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ВводОстатковАвтомобилей).Контрагент=&Контрагент";
			КонецЕсли;
		КонецЕсли;
		ТекстЗапроса=ТекстЗапроса+"
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ПоступлениеАвтомобилей) В (&Партии)
		|		  ИЛИ ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ВводОстатковАвтомобилей) В (&Партии)
		|			ТОГДА 0
		|		КОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ПоступлениеАвтомобилей).Контрагент = &Контрагент
		|		  ИЛИ ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.Партия КАК Документ.ВводОстатковАвтомобилей).Контрагент = &Контрагент
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ,
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Партия,
		|	ОстаткиАвтомобилейОстатки.ГТД,
		|	ОстаткиАвтомобилей.СтавкаНДС
		|
		|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиАвтомобилей.Остатки
		|
		|УПОРЯДОЧИТЬ ПО ОстаткиАвтомобилейОстатки.Автомобиль,ПорядокСписанияПартий Возр,ОстаткиАвтомобилейОстатки.Партия Убыв";
		Запрос=Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Момент",ДокументОбъект.МоментВремени());
		Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
		Запрос.УстановитьПараметр("Автомобиль",РезультатЗапросаПоАвтомобилям.ВыгрузитьКолонку("Автомобиль"));
		Запрос.УстановитьПараметр("СтатусПартии",СтатусПартии);
		Запрос.УстановитьПараметр("Партии",РезультатЗапросаПоАвтомобилям.ВыгрузитьКолонку("Партия"));
		Запрос.УстановитьПараметр("Контрагент",ДокументОбъект.Контрагент);
		Запрос.УстановитьПараметр("ВидДвиженияПриход",ВидДвиженияНакопления.Приход);
		
		// Наложим блокировку на считываемые данные
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ОстаткиАвтомобилей");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, ДокументОбъект.Дата)); 
		ЗначенияБлокировки.Вставить("СкладКомпании", СкладКомпании); 
		ЗначенияБлокировки.Вставить("СтатусПартии", СтатусПартии); 
		СтруктураПараметровБлокировки.Вставить("ИсточникДанных", РезультатЗапросаПоАвтомобилям);
		ОписаниеИсточника = Новый Соответствие;
		ОписаниеИсточника.Вставить("Автомобиль", "Автомобиль");
		обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);

		ТаблицаПартий=Запрос.Выполнить().Выгрузить();
		
		// Структура отбора
		СтруктураОтбора=Новый Структура("Автомобиль");
		
		// Возвращаем
		Для Каждого СтрокаАвтомобиль Из РезультатЗапросаПоАвтомобилям Цикл
			НадоВернуть=СтрокаАвтомобиль.Количество;
			// Ищем поступившие партии
			СтруктураОтбора.Автомобиль=СтрокаАвтомобиль.Автомобиль;
			МассивНайденныхСтрок=ТаблицаПартий.НайтиСтроки(СтруктураОтбора);
			// Инициализируем переменные для расчета усредненной цены списанных партий
			ОбщаяСумма = 0; ОбщаяСуммаУпр=0; ОбщаяСуммаНДС = 0; ОбщееКоличество = 0;
			ЕстьПартииТоваров = Ложь; 
			Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
				ТекСтрока=МассивНайденныхСтрок[Сч];
				//СвободныйОстаток=ТекСтрока.Количество-ТекСтрока.Резерв;
				//Если СвободныйОстаток=0 Тогда Продолжить; КонецЕсли;
				Если НЕ обЗначениеНеЗаполнено(СтрокаАвтомобиль.Партия) И СтрокаАвтомобиль.Партия<>ТекСтрока.Партия Тогда
					Продолжить;
				КонецЕсли;
				
				ЕстьПартииТоваров = Истина; 
				
				НоваяЗапись=Добавить();
				НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период      = ДокументОбъект.Дата;
				НоваяЗапись.Регистратор = ДокументОбъект.Ссылка;
				Партия = ТекСтрока.Партия;
				НоваяЗапись.Партия        = Партия;
				НоваяЗапись.СтатусПартии  = СтатусПартии;
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Автомобиль    = ТекСтрока.Автомобиль;
				НоваяЗапись.ГТД           = ТекСтрока.ГТД;
				НоваяЗапись.ХозОперация   = ДокументОбъект.ХозОперация;
				НоваяЗапись.СтавкаНДС     = ТекСтрока.СтавкаНДС;
				// Возвращаем
				Если ТекСтрока.Количество>0 Тогда
					НоваяЗапись.Количество = -Мин(НадоВернуть,ТекСтрока.Количество);
					НоваяЗапись.Сумма      = Окр(-?(ТекСтрока.Количество<НадоВернуть,ТекСтрока.Сумма,ТекСтрока.Сумма/ТекСтрока.Количество*НадоВернуть),2);
					НоваяЗапись.СуммаУпр   = Окр(-?(ТекСтрока.Количество<НадоВернуть,ТекСтрока.СуммаУпр,ТекСтрока.СуммаУпр/ТекСтрока.Количество*НадоВернуть),2);
					НоваяЗапись.СуммаНДС   = Окр(-?(ТекСтрока.Количество<НадоВернуть,ТекСтрока.СуммаНДС,ТекСтрока.СуммаНДС/ТекСтрока.Количество*НадоВернуть),2);
				ИначеЕсли ТекСтрока.Количество<0 Тогда // В этом случае вернем все, что есть в партии
					НоваяЗапись.Количество=-ТекСтрока.Количество;
					НоваяЗапись.Сумма=Окр(-ТекСтрока.Сумма,2);
					НоваяЗапись.СуммаУпр=Окр(-ТекСтрока.СуммаУпр,2);
					НоваяЗапись.СуммаНДС=Окр(-ТекСтрока.СуммаНДС,2);
				КонецЕсли;
				
				// Запомним удельные значения списания для отрицательной партии товаров
				ОбщаяСумма = ОбщаяСумма + НоваяЗапись.Сумма;
				ОбщаяСуммаУпр = ОбщаяСуммаУпр + НоваяЗапись.СуммаУпр;
				ОбщаяСуммаНДС = ОбщаяСуммаНДС+ НоваяЗапись.СуммаНДС;
				ОбщееКоличество = ОбщееКоличество + НоваяЗапись.Количество;
				
				// Удалим ненужные строки
				ТаблицаПартий.Удалить(ТекСтрока);
				
				// Уменьшаем количество которое надо списать
				НадоВернуть=НадоВернуть-(-НоваяЗапись.Количество);
				Если НадоВернуть<=0 Тогда Прервать; КонецЕсли;
			КонецЦикла;
			
			// Проверим чего осталось
			Если НадоВернуть>0 и ОтрицательныеОстаткиРазрешены Тогда
				НоваяЗапись = Добавить();
				НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период        = ДокументОбъект.Дата;
				НоваяЗапись.Регистратор   = ДокументОбъект.Ссылка;
				НоваяЗапись.Партия        = ДокументОбъект.Ссылка;
				НоваяЗапись.СтатусПартии  = СтатусПартии;
				НоваяЗапись.СкладКомпании = СкладКомпании;
				НоваяЗапись.Автомобиль    = СтрокаАвтомобиль.Автомобиль;
				НоваяЗапись.ГТД           = Справочники.ГТД.ПустаяСсылка();
				НоваяЗапись.ХозОперация   = ДокументОбъект.ХозОперация;
				НоваяЗапись.Количество    = -НадоВернуть;
				НоваяЗапись.Сумма         = 0;
				НоваяЗапись.СуммаУпр      = 0;
				НоваяЗапись.СуммаНДС      = 0;
				Если ВыводитьКритическиеСообщения Тогда
					дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобиль.Автомобиль)+""" получены отрицательные остатки.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобиль.Автомобиль);
				КонецЕсли; 
				
			ИначеЕсли НадоВернуть>0 Тогда
				// Не удалось вернуть товар
				дкСообщитьРезультат("Автомобиль """+СокрЛП(СтрокаАвтомобиль.Автомобиль)+""" не удалось вернуть.","Важное&Остатки автомобилей:",ДокументОбъект,СтрокаАвтомобиль.Автомобиль);
				ВсеОК=Ложь;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		//<<Павличенко 16.03.18
		//Если ДокументОбъект.ХозОперация = Справочники.ХозОперации.ВозвратАвтомобилейОтПокупателяКомиссия Тогда
		Если ЛОЖЬ И ДокументОбъект.ХозОперация = Справочники.ХозОперации.ВозвратАвтомобилейОтПокупателяКомиссия Тогда
		//>>Павличенко 16.03.18
			// ВОЗВРАТ АВТОМОБИЛЕЙ С КОМИССИИ
			Расход = 0;
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	АвтомобилиОтданныеОстатки.Автомобиль,
			|	АвтомобилиОтданныеОстатки.ДокументПередачи,
			|	АвтомобилиОтданныеОстатки.Партия,
			|	АвтомобилиОтданныеОстатки.ГТД,
			|	АвтомобилиОтданныеОстатки.КоличествоОстаток,
			|	АвтомобилиОтданныеОстатки.СуммаСебестоимостиУпрОстаток,
			|	АвтомобилиОтданныеОстатки.СуммаСебестоимостиРеглОстаток,
			|	ВЫБОР
			|		КОГДА АвтомобилиОтданныеОстатки.СуммаНДСОстаток = 0
			|				ИЛИ АвтомобилиОтданныеОстатки.СуммаОстаток = 0
			|			ТОГДА 0
			|		ИНАЧЕ АвтомобилиОтданныеОстатки.СуммаНДСОстаток * 100 / АвтомобилиОтданныеОстатки.СуммаОстаток
			|	КОНЕЦ КАК СтавкаНДС
			|ИЗ
			|	РегистрНакопления.АвтомобилиОтданные.Остатки(
			|			&НаМомент,
			|			Автомобиль В (&СписокАвто)
			|				И Контрагент = &Контрагент
			|				И ДоговорВзаиморасчетов = &Договор) КАК АвтомобилиОтданныеОстатки
			|
			|ДЛЯ ИЗМЕНЕНИЯ";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("НаМомент"   , ДокументОбъект.Дата);
			Запрос.УстановитьПараметр("СписокАвто" , РезультатЗапросаПоАвтомобилям.ВыгрузитьКолонку("Автомобиль"));
			Запрос.УстановитьПараметр("Контрагент" , ДокументОбъект.Контрагент);
			Запрос.УстановитьПараметр("Договор"    , ДокументОбъект.ДоговорВзаиморасчетов);
			РезультатЗапросаПоОтданным = Запрос.Выполнить();
			
			// Наложим блокировку на считываемые данные
			СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "АвтомобилиОтданные");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, ДокументОбъект.Дата)); 
			СтруктураПараметровБлокировки.Вставить("ИсточникДанных", РезультатЗапросаПоАвтомобилям);
			ОписаниеИсточника = Новый Соответствие;
			ОписаниеИсточника.Вставить("Автомобиль", "Автомобиль");
			обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
			
			ТаблицаОтданных   = РезультатЗапросаПоОтданным.Выгрузить();
			ТаблицаАвтомобили = РезультатЗапросаПоАвтомобилям;
			
			// создание структуры отбора авто
			СтруктураОтбора = Новый Структура("Автомобиль,ДокументПередачи");
			Расход = 0;
			Для Каждого ТекСтрока Из ТаблицаАвтомобили Цикл
				СтруктураОтбора.Автомобиль       = ТекСтрока.Автомобиль;
				СтруктураОтбора.ДокументПередачи = ТекСтрока.Партия;
				
				МассивНайденныхСтрок = ТаблицаОтданных.НайтиСтроки(СтруктураОтбора);
				Если МассивНайденныхСтрок.Количество() = 0 Тогда
					НоваяЗапись=Добавить();
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Приход;
					НоваяЗапись.Период        = ДокументОбъект.Дата;
					НоваяЗапись.Регистратор   = ДокументОбъект.Ссылка;
					НоваяЗапись.Автомобиль    = ТекСтрока.Автомобиль;
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.СтатусПартии  = Перечисления.СтатусыПартий.ТоварКупленный;
					ПартияВозврата = ДокументОбъект.Ссылка;
					НоваяЗапись.Партия      = ПартияВозврата;
					НоваяЗапись.ГТД         = Справочники.ГТД.ПустаяСсылка();
					НоваяЗапись.Количество  = 1;
					НоваяЗапись.Сумма       = 0;
					НоваяЗапись.СуммаУпр    = 0;
					НоваяЗапись.СуммаНДС    = 0;
					НоваяЗапись.ХозОперация = ДокументОбъект.ХозОперация;
					Расход=Расход+НоваяЗапись.СуммаУпр;
				Иначе
					СтрокаОтданных = МассивНайденныхСтрок[0];
					
					НоваяЗапись = Добавить();
					НоваяЗапись.Регистратор   = ДокументОбъект.Ссылка;
					НоваяЗапись.ВидДвижения   = ВидДвиженияНакопления.Расход;
					НоваяЗапись.Период        = ДокументОбъект.Дата;
					НоваяЗапись.Автомобиль    = СтрокаОтданных.Автомобиль;
					НоваяЗапись.СкладКомпании = СкладКомпании;
					НоваяЗапись.СтатусПартии  = Перечисления.СтатусыПартий.ТоварКупленный;
					ПартияВозврата = СтрокаОтданных.Партия;
					НоваяЗапись.ГТД         = СтрокаОтданных.ГТД;
					НоваяЗапись.Партия      = ПартияВозврата;
					НоваяЗапись.Количество  = -1;
					НоваяЗапись.Сумма       = -СтрокаОтданных.СуммаСебестоимостиРеглОстаток;
					НоваяЗапись.СуммаУпр    = -СтрокаОтданных.СуммаСебестоимостиУпрОстаток;
					НоваяЗапись.СуммаНДС    = -(СтрокаОтданных.СуммаСебестоимостиРеглОстаток*СтрокаОтданных.СтавкаНДС)/100;
					
					Если СтрокаОтданных.СтавкаНДС <> 0 Тогда
						НоваяЗапись.СтавкаНДС = ТекСтрока.СтавкаНДС;
					Иначе
						НоваяЗапись.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
					КонецЕсли;
					
					НоваяЗапись.ХозОперация = ДокументОбъект.ХозОперация;
					
					Расход=Расход+(-НоваяЗапись.СуммаУпр);
				КонецЕсли;
			КонецЦикла;
		Иначе
			// ВОЗВРАТ ОТ ПОКУПАТЕЛЯ
			Расход=0;
			Запрос=Новый Запрос("
			|ВЫБРАТЬ
			|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
			|	ОстаткиАвтомобилей.Регистратор КАК ДокументОтгрузки,
			|	ОстаткиАвтомобилей.Партия КАК Партия,
			|	ОстаткиАвтомобилей.ГТД КАК ГТД,
			|	ОстаткиАвтомобилей.СтатусПартии КАК СтатусПартии,
			|	ОстаткиАвтомобилей.Количество КАК Количество,
			|	ВЫБОР КОГДА ОстаткиАвтомобилей.СтатусПартии=&СтатусПартииТоварПринятыйКомиссия ТОГДА
			|		ЕСТЬNULL(РегистрНакопленияРеализованныеАвтомобили.КоличествоОстаток,0)
			|	ИНАЧЕ
			|		ОстаткиАвтомобилей.Количество
			|	КОНЕЦ КАК КоличествоРеализованных, 
			|	ОстаткиАвтомобилей.Сумма КАК Сумма,
			|	ОстаткиАвтомобилей.СуммаУпр КАК СуммаУпр,
			|	ОстаткиАвтомобилей.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РеализованныеАвтомобили.Остатки(&НаМомент) КАК РегистрНакопленияРеализованныеАвтомобили
			|		ПО 	ОстаткиАвтомобилей.Автомобиль = РегистрНакопленияРеализованныеАвтомобили.Автомобиль
			|			И ОстаткиАвтомобилей.Партия = РегистрНакопленияРеализованныеАвтомобили.ДокументПередачи
			|ГДЕ
			|	ОстаткиАвтомобилей.Регистратор В (ВЫБРАТЬ РАЗЛИЧНЫЕ ВЫРАЗИТЬ("+Партия+" КАК Документ.РеализацияАвтомобилей) ИЗ Документ.ВозвратОтПокупателяАвтомобилей.Автомобили ГДЕ Ссылка=&Ссылка И "+Партия+" ССЫЛКА Документ.РеализацияАвтомобилей)
			|   И ОстаткиАвтомобилей.Автомобиль В (&Автомобиль)
			|   И ОстаткиАвтомобилей.ВидДвижения = &ВидДвижения
			|
			|ДЛЯ ИЗМЕНЕНИЯ РегистрНакопления.ОстаткиАвтомобилей
			|
			|УПОРЯДОЧИТЬ ПО 
			|	ОстаткиАвтомобилей.НомерСтроки Убыв
			|");
			Запрос.УстановитьПараметр("НаМомент",ДокументОбъект.Дата);
			Запрос.УстановитьПараметр("Автомобиль",РезультатЗапросаПоАвтомобилям.ВыгрузитьКолонку("Автомобиль"));
			Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
			Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
			Запрос.УстановитьПараметр("СтатусПартииТоварПринятыйКомиссия",Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
			РезультатЗапросаВозвратОтПокупателя=Запрос.Выполнить();
			
			// Наложим блокировку на считываемые данные
			СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ОстаткиАвтомобилей");
			ЗначенияБлокировки = Новый Соответствие;
			ЗначенияБлокировки.Вставить("Период",      Новый Диапазон(, ДокументОбъект.Дата)); 
			СтруктураПараметровБлокировки.Вставить("ИсточникДанных", РезультатЗапросаПоАвтомобилям);
			ОписаниеИсточника = Новый Соответствие;
			ОписаниеИсточника.Вставить("Автомобиль", "Автомобиль");
			обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
			
			ТаблицаОтгрузки=РезультатЗапросаВозвратОтПокупателя.Выгрузить();
			
			// Создадим структуру отбора
			СтруктураОтбора=Новый Структура("Автомобиль,ДокументОтгрузки");
			
			ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(); 
			СтруктураКурса = обКурсДляВалюты(ВалютаРегл,ДокументОбъект.Дата);
			КурсРегл	   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить(); 
			Попытка
				КурсУпр=ДокументОбъект.КурсВалютыУпр;
			Исключение
				КурсУпр=Неопределено;
			КонецПопытки; 
			Если КурсУпр=Неопределено ИЛИ обЗначениеНеЗаполнено(КурсУпр) Тогда
				СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ДокументОбъект.Дата);
				КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			КонецЕсли;
			
			// Пройдемся по таблице автомобилей и отсторнируем отгрузку
			ТаблицаАвтомобили=РезультатЗапросаПоАвтомобилям;
			Для Каждого СтрокаАвтомобиль Из ТаблицаАвтомобили Цикл
				// Заполним структуру отбора
				СтруктураОтбора.Автомобиль=СтрокаАвтомобиль.Автомобиль;
				СтруктураОтбора.ДокументОтгрузки=СтрокаАвтомобиль.Партия;
				// Поищем строки удовлетворяющие условию
				МассивНайденныхСтрок=ТаблицаОтгрузки.НайтиСтроки(СтруктураОтбора);
				// Пройдемся по найденным строкам и вернем товар
				НадоВернуть=СтрокаАвтомобиль.Количество;
				Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
					ТекСтрока=МассивНайденныхСтрок[Сч];
					
					Возвращаем=Мин(НадоВернуть,ТекСтрока.Количество);
					Если ТекСтрока.КоличествоРеализованных>0 Тогда
						Возвращаем=Мин(Возвращаем,ТекСтрока.КоличествоРеализованных);
					КонецЕсли; 
					
					НоваяЗапись=Добавить();
					НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Расход;
					НоваяЗапись.Период=ДокументОбъект.Дата;
					НоваяЗапись.Регистратор=ДокументОбъект.Ссылка;
					НоваяЗапись.Автомобиль=ТекСтрока.Автомобиль;
					НоваяЗапись.СкладКомпании=СкладКомпании;
					НоваяЗапись.ГТД = ТекСтрока.ГТД;
					Если ТекСтрока.КоличествоРеализованных>0 Тогда
						НоваяЗапись.СтатусПартии=ТекСтрока.СтатусПартии;
						ПартияВозврата=ТекСтрока.Партия;
					Иначе
						НоваяЗапись.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
						ПартияВозврата=ДокументОбъект.Ссылка;
					КонецЕсли; 
					НоваяЗапись.Партия=ПартияВозврата;
					НоваяЗапись.Количество=-Мин(НадоВернуть,ТекСтрока.Количество);
					НоваяЗапись.Сумма=Окр(-?(ТекСтрока.Количество<НадоВернуть,ТекСтрока.Сумма,ТекСтрока.Сумма/ТекСтрока.Количество*НадоВернуть),2);
					НоваяЗапись.СуммаУпр=Окр(-?(ТекСтрока.Количество<НадоВернуть,ТекСтрока.СуммаУпр,ТекСтрока.СуммаУпр/ТекСтрока.Количество*НадоВернуть),2);
					НоваяЗапись.СуммаНДС=Окр(-?(ТекСтрока.Количество<НадоВернуть,ТекСтрока.СуммаНДС,ТекСтрока.СуммаНДС/ТекСтрока.Количество*НадоВернуть),2);
					НоваяЗапись.ХозОперация=ДокументОбъект.ХозОперация;
					НоваяЗапись.СтавкаНДС=СтрокаАвтомобиль.СтавкаНДС;
					Расход=Расход+(-НоваяЗапись.СуммаУпр);
					// Удалим ненужные строки
					ТаблицаОтгрузки.Удалить(ТекСтрока);
					// Уменьшаем количество которое надо списать
					НадоВернуть=НадоВернуть-(-НоваяЗапись.Количество);
					Если НадоВернуть<=0 Тогда Прервать; КонецЕсли;
				КонецЦикла;
				// Если после всяких возвратов у нас еще остался товар, который вернуть не удалось, то
				// оприходуем этот товар на документ возврата
				Если НадоВернуть>0 Тогда
					НоваяЗапись=Добавить();
					НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
					НоваяЗапись.Период=ДокументОбъект.Дата;
					НоваяЗапись.Регистратор=ДокументОбъект.Ссылка;
					НоваяЗапись.Автомобиль=СтрокаАвтомобиль.Автомобиль;
					НоваяЗапись.СкладКомпании=СкладКомпании;
					НоваяЗапись.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
					ПартияВозврата = ДокументОбъект.Ссылка;
					НоваяЗапись.Партия = ПартияВозврата;
					НоваяЗапись.ГТД = Справочники.ГТД.ПустаяСсылка();
					НоваяЗапись.Количество=НадоВернуть;
					НоваяЗапись.Сумма=0;
					НоваяЗапись.СуммаУпр=0;
					НоваяЗапись.СуммаНДС=0;
					НоваяЗапись.ХозОперация=ДокументОбъект.ХозОперация;
					Расход=Расход+НоваяЗапись.СуммаУпр;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	// Запись движений
	ЗаписыватьДвижения=?(ЗаписыватьДвижения=Неопределено,Истина,ЗаписыватьДвижения);
	Если ВсеОК И ЗаписыватьДвижения Тогда Записать(); КонецЕсли;
	
	РезультатЗапросаПоАвтомобилям=Неопределено;
	СтруктураДопРасходов=Неопределено;
	СкладКомпании=Неопределено;
	СкладПолучатель=Неопределено;
	СтатусПартии=Неопределено;
	РежимВозврата=Неопределено;
	Партия=Неопределено;
	// Убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	
	Возврат ВсеОК;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()

///////////////////////////////////////////////////////////////////////
//Инициализация переменных модуля набора записей

РежимПроведения=РежимПроведенияДокумента.Оперативный;

ДокументОбъект=Неопределено; // !!! Обязательный к заполнению перед началом проведения
РезультатЗапросаПоАвтомобилям=Неопределено;
СкладКомпании=Неопределено;

РежимДопРасходы=0;
СтруктураДопРасходов=Неопределено;
ГраницаРасчетаОстатков=Неопределено;

//Сторно=Ложь;
//Приходовать=Истина;
//Резервировать=Ложь;
СторноПриход = Неопределено;
